export default [
  {
    id: "1",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 1",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/RfHw3oQRbgg",
    text: "В задании описаны методы жизненного цикла классового компонента: constructor(props) - установление пропсов и стейтов; static getDerivedStateFromProps(props,state) {} - следует применять, когда состояние зависит от пропсов componentDidMount() {} - когда компонент был смонтирован componentDidUpdate() {} - когда компонент был обновлен Для функционального класса показано через вывод в консоли, что все запускается каждый раз. [Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card5_task1)",
  },

  {
    id: "2",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 2 ",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/hZcKg7c7lbQ",
    text: "В видео описано несколько способов использования условных операторов: 1 способ - стандартный IF-else 2 способ switch; case 3 способ тернарный оператор в зависимости от переменной return условие ? действие 1: действие 2  4 способ использование тернарного оператора внутри тега <div> и использованием Fragment 5 способ использование оператора внутри тега img и div 6 способ  использование && в теге div  с использованием Fragment [Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card6_task2/)",

  },

  {
    id: "3",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 3 ",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/hzB0CvJANn8",
    text: "В ролике показан пример использования условного оператора if  и тернарный оператор., как применять условный оператор с компонентом и как создать рекурсивный элемент с использованием тернарного оператора.[Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card6_task3)",

  },

  ];
