export default [
  {
    id: "1",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 1",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Что вам понравилось? А что хотелось бы улучшить в рассказе? https://www.youtube.com/embed/IXXO2-xnI8U Посмотреть и кратко описать в карточке сюжет видео ролика. Что вам понравилось? А что хотелось бы улучшить в рассказе? https://www.youtube.com/embed/rlTvbjScIKA",
    text: "Видео про элементы Хотелось более подробно чтобы было показано использование объектов в элементе. Т.е. в видео создали 1 элемент, содержащий 2 заголовка, 1 объект и применили метод. Можно было бы также добавить, что элементы можно создавать не в функции, а глобально. И также сделать примеры интервалов, которые может принимать метод setInterval() и как это будет рендериться. В начале ролика упоминаются unmountComponentAtNode() и FindDOMNode, хотелось бы узнать в каких случаях их применять, а в конце занятия ведущий говорит, что в следующих уроках он будет раскрывать понятие компонента. Видео про компоненты Хотелось бы убрать рекламу из ролика и добавить использование нескольких раз одного и того же компонента на странице. Очень хорошо, что показано создание разных компонентов. Очень классная картинка на 1:28 видео, если б еще эти же названия компонентов были потом на видео было бы вообще супер. Показано создание функционального и классового компонентов, а также компонента с использованием стрелочной функции и использование компонента в компоненте. В видео довольно просто и доходчиво показано как использовать props, как устанавливать значения по умолчанию, что в функциональных компонентах необходимо использовать props.<название свойства>, а в классовых использовать this.props.<название свойства>. В видео показано применение в пропсах числовых данных, строковых и массива, хотелось бы еще показать булевые переменные. ",
  },

  {
    id: "2",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 2 ",
    task: "Создать новое приложение React и добавьте ссылку на https://stackblitz.com/ в историю карточки. Приложение часы из примера в задании 1 с изменением раз в 30 секунд.",
    text: "Ссылка на приложение [Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card3-Task2?file=src%2Findex.js)",

  },

  {
    id: "3",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 3 ",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Что вам понравилось? А что хотелось бы улучшить в рассказе?https://www.youtube.com/embed/kv-T62uFJZg",
    text: "В видео рассказывается как создать приложение с отображением картинки сверху и 3 блоками, каждый из которых содержит заголовок и текстовое описание. Также добавлены классы к дивам.",

  },

  {
    id: "4",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 4",
    task: "Создать новое приложение React и добавьте ссылку на https://stackblitz.com/ в историю карточки. Приложением блога из примера в задании 2. Тема новостей своя (путешествие, машины и тп.).",
    text: " Ссылка на проект : [Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card3-task4) Почему-то картинки не подгружаются stackblitz корректно.",

  },

  {
    id: "5",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 5",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Что вам понравилось? А что хотелось бы улучшить в рассказе?https://www.youtube.com/embed/-z-OAVigStA",
    text: "В видео показывается как рендерятся объекты в зависимости от пропсов. В начале берётся готовый код и изменяется, чтобы передавать пропсы и в зависимости от пропсов отображается тот или иной элемент. В примере есть лишний код, который будет путать новичков, но с другой стороны, наверное это жизненная ситуация, когда существующий код необходимо улучшить. Хотелось бы разбить видео на показ самого рендеринга и отдельно условного оператора. Лично мне нравиться когда в видео отдельным слайдом показывается синтаксические конструкции.",

  },
  {
    id: "6",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 6",
    task: "Посмотрев пример в задании 5 создать новое приложение React и добавьте ссылку на https://stackblitz.com/ в историю карточки. Приложение должно отображать только одну статью по выбору из списка (в качестве альтернативы может быть выбор другой тематики например бенефит услуг ДМС: 🦷 зубы, 👀 глаза, сосуды, амбулаторное лечение и тп. по выбору отображается список услуг и клиник)",
    text: "Пока не все получилось как надо. Пока не получается сохранить значение выпадающего списка. Ссылка на проект https://stackblitz.com/edit/github-tpqhvj?file=src/App2.js",

  },
  

];
