export default [
  {
    id: "1",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 1",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Что вам понравилось? А что хотелось бы улучшить в рассказе?  Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/Q7FkSWMf2Qo",
    text: "[Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card4-task1)",
  },

  {
    id: "2",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 2 ",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Кто читал видео (кампания, лектор)? Добавьте ссылку на github профиля лектора. Перепишите пример с видео и добавьте ссылку в комментариях.  https://www.youtube.com/embed/yzxE3M_xx3w",
    text: "[Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card4_task2) Ролик читал Алексей Данчин, который является преподавателем школы Constcode.Ссылка на его гитхаб https://github.com/Aleksey-Danchin/react-youtube-tutorial",

  },

  {
    id: "3",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 3 ",
    task: "Посмотреть и кратко описать в карточке о чём это видео. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/qqeKBHnRR6A",
    text: "В видео показано различия между классовым и функциональным компонентом. Ссылка на проект https://stackblitz.com/github/SerzhanaB/card4_task3",

  },

  {
    id: "4",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 4",
    task: "Посмотреть и кратко описать в карточке о чём это видео. https://www.youtube.com/embed/7JNz14uTMTE",
    text: "Создавать классовый компонент можно 2 способами: import React,{Component} from react;class NameClass extends Component {}  export default App8; Либо import React,{Component} from react ;export default class NameClass extends Component {...} В видео функции для обработки события объявлены как стрелочные функции и при изменении события они вызываются: onClick={this.handlerClick}onChange={this.handlerChange}",

  },

  {
    id: "5",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 5",
    task: " Посмотреть и кратко описать в карточке о чём это видео. Перепишите пример и добавьте ссылку в комментариях. Пусть в стейте хранится массив с характеристиками самоката. У каждого самоката есть наименование, остаток заряда и стоимость в час. Выведите все самокаты на экран с помощью цикла. Сделайте так, чтобы отображением самоката на экран занимался отдельный компонент. https://www.youtube.com/embed/isrKkL_54Eo",
    text: "[Ссылка на проект ](https://stackblitz.com/github/SerzhanaB/card4_task5/)   Доделала задание",

  },
  {
    id: "6",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 6",
    task: "Дан массив с работниками. У каждого работника есть имя, фамилия, количество отработанных дней и зарплатная ставка за день. Выведите этих работников на экран в виде таблицы. Сделайте так, чтобы в последней колонке автоматически рассчитывалась зарплата работника (количество отработанных дней умножить на ставку). Сделайте так, чтобы количество дней и ставка выводились в виде инпутов. Если поредактировать эти инпуты - зарплата также должна поменяться. Под таблицей также выведите суммарную зарплату всех работников.",
    text: "Ссылка на проект https://stackblitz.com/github/SerzhanaB/card4_task6",

  },
  {
    id: "7",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 7",
    task: "Дан следующий стейт: this.state = {show: true, name: 'Иван'}; Изначально результат работы метода render следующий ('Иван' берется из this.state.name): <div><p>Привет, Иван!</p></div> Сделайте так, чтобы если this.state.show был равен true, то выводился текст 'Привет, Иван', а если равен false - то 'Пока, Иван'",
    text: "Ссылка на проект https://stackblitz.com/github/SerzhanaB/card4_task7 ",

  },
  {
    id: "8",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 8",
    task: "Дан массив языков ['html', 'css', 'js', 'php']. Выведите эти языки в виде списка <ul>.",
    text: " [Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card4_task8)",

  },
  {
    id: "9",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 9",
    task: "Дан массив с числами. Выведите эти числа каждое в своем <span> так, чтобы на выводе к каждому числу прибавлялось число 3.",
    text: " Сделала в одном проекте с 8 заданием [Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card4_task8)",

  },
  {
    id: "10",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 10",
    task: "Реализуйте игру крестики-нолики. Играют два игрока, каждый ходит по очереди.",
    text: "**npx create-react-app** - команда, которая в выбранной директории создает шаблонный проект React-приложения. Данный проект имеет необходимый и достаточный набор пакетов для создания простого веб-приложения. npx create-react-app [name your's new application]",

  },

  {
    id: "11",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 11",
    task: "Создать новый React с использованием react UI library [Ant Design of React](https://ant.design/docs/react/getting-started) проект и изменить текст на странице как вам понравилось первое занятие? И что Вы хотели бы улучшить.",
    text: "Опубликовала проект [Ссылка на проект](https://stackblitz.com/github/SerzhanaB/ReactHomeWork1--CARD1-Task11)",

  },

];
