export default [
  {
    id: "1",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 1",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/ty2ApOkMRws",
    text: "В задании описаны методы жизненного цикла классового компонента: constructor(props) - установление пропсов и стейтов; static getDerivedStateFromProps(props,state) {} - следует применять, когда состояние зависит от пропсов componentDidMount() {} - когда компонент был смонтирован componentDidUpdate() {} - когда компонент был обновлен Для функционального класса показано через вывод в консоли, что все запускается каждый раз. [Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card5_task1)",
  },

  {
    id: "2",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 2 ",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/CHFD45QYtI8",
    text: "В ролике рассказывается о методах: componentDidMount() {} - вызывается когда компонент был смонтирован, в него добавили вызов функции отображения времени. componentDidUpdate() {} - вызывается когда компонент был обновлен componentWillUnmount() {} - вызывается при размонтировании компонента, добавили метод по очистке интервала.[ссылка на проект](https://stackblitz.com/github/SerzhanaB/card5-task2)",

  },

  {
    id: "3",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 3 ",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/m_mtV4YaI8c",
    text: "В ролике показано применение методов для счетчика: Монтирование и размонтирование компонента, передача исходного состояния через Props. Немного не поняла для чего ввели seeds. Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card5_task3)",

  },

  {
    id: "4",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 4",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/enpVbjOSLpQ",
    text: "В видео рассказывается о методах жизненного цикла, какие используются часто, а какие нет. [Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card5_task4)",

  },

  {
    id: "5",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 5",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/i2NE0cbuQa4",
    text: "[Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card5_task5)",

  },
  {
    id: "6",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 6",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика и добавить в комментарии внешнюю ссылку с пользователями. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/auAtFC5nfTs",
    text: "В ролике рассказывается про метод componentDidMount() и использование библиотеки axios, которая позволяет получать ответ от сервера и автоматически конвертировать в JSON. [Ссылка на юзеров](https://social-network.samuraijs.com/api/1.0/users) [Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card5_task6)",

  },
  {
    id: "7",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 7",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/bMApsb0FpFE",
    text: "В ролике рассказано про методы жизненного цикла компонента. В примере показано как срабатывают методы и разобран пример  как можно по событию изменить стили элемента. [Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card5_task7)",

  },
  {
    id: "8",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 8",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/4xjWX3oRQoc",
    text: " ссылка на проект https://stackblitz.com/github/SerzhanaB/card5_task-8 Лектор советует поставить следующие сниппеты:react-native-snippets,react-native-snippets-horse (не нашла) react-redux-react- native-snippets (не нашла)Ссылка на диаграмму: https://projects.wojtekmaj.pl/react-lifecycle-methods-diagram/",

  },
 

];
