export default [
  {
    id: "1",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 1",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/dENUw979QiY",
    text: "В ролике описано как сделать подъем состояния из дочерних элементов в родительский, а также показано, как менять текст в textarea и отображать этот текст, а также как переключаться между объектами. [Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card8_task1) ",
  },

  {
    id: "2",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 2 ",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/qdaDgC_xU0w",
    text: "показано как сделать аккордеон по открытию статей, и перенос действия по кнопке в вышестоящий компонент [Ссылка на проект] (https://stackblitz.com/github/SerzhanaB/card8_task2)",

  },

  {
    id: "3",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 3 ",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/a2DkRBnp4ns",
    text: "Рассказывается как работать с массивами, делая копию массива и делая манипуляции с копией. При необходимости перезаписывая исходный стейт. А также про функцию slice(), map() и sort(). [ссылка на проект](https://stackblitz.com/github/SerzhanaB/task--card3)",

  },

  {
    id: "4",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 4",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/niRuU0RbYgI",
    text: "Описание команды uninstall npm uninstall - команда удаляет данный пакет из разделов: dependencies, devDependencies, optionalDependencies и peerDependencies objects в файле package.json. Пример вызова команды: npm uninstall [namepackage] Также ее можно вызвать следующими командами: remove, rm, r, un, unlink",

  },

  {
    id: "5",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 5",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/j3MkFO0pUVo",
    text: "Описание команды install\n**npm install** - команда устанавливает указанный пакет, по умолчанию установка происходит в текущей директории.\nПример вызова команды:\n\n```\nnpm install [namepackage]\n```\nТакже ее можно вызвать\n\n```\nnpm i [namepackage]\n```\nили\n\n```\nnpm add [namepackage]\n```\nОпционально можно задать директорию куда необходимо установить пакет, конкретную версию пакета или диапазон версий пакета, а также ссылку или URL откуда скачивать пакет.\n\nДля глобальной установки используется флаг --global, его можно записывать сокращенно -g.\nПример\n\n```\nnpm i [namepackage] -g\n",

  },
  {
    id: "6",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 6",
    task: "JS! Посмотреть и кратко описать в карточке плюсы и минусы. Привести СВОЙ пример сравнения и добавьте ссылку в комментариях. https://www.youtube.com/embed/v6AVfIupNB8",
    text: "Описание команды install\n**npm install** - команда устанавливает указанный пакет, по умолчанию установка происходит в текущей директории.\nПример вызова команды:\n\n```\nnpm install [namepackage]\n```\nТакже ее можно вызвать\n\n```\nnpm i [namepackage]\n```\nили\n\n```\nnpm add [namepackage]\n```\nОпционально можно задать директорию куда необходимо установить пакет, конкретную версию пакета или диапазон версий пакета, а также ссылку или URL откуда скачивать пакет.\n\nДля глобальной установки используется флаг --global, его можно записывать сокращенно -g.\nПример\n\n```\nnpm i [namepackage] -g\n",

  },
  {
    id: "7",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 7",
    task: "Выполнить задание и добавьте ссылку в комментариях. Полицейский радар скорости, который сообщает о том, превышена ли скорость или нет.",
    text: "Описание команды install\n**npm install** - команда устанавливает указанный пакет, по умолчанию установка происходит в текущей директории.\nПример вызова команды:\n\n```\nnpm install [namepackage]\n```\nТакже ее можно вызвать\n\n```\nnpm i [namepackage]\n```\nили\n\n```\nnpm add [namepackage]\n```\nОпционально можно задать директорию куда необходимо установить пакет, конкретную версию пакета или диапазон версий пакета, а также ссылку или URL откуда скачивать пакет.\n\nДля глобальной установки используется флаг --global, его можно записывать сокращенно -g.\nПример\n\n```\nnpm i [namepackage] -g\n",

  },
  

];
