export default [
  {
    id: "1",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 1",
    task: "Изучить видео и кратко описать комментарием к карточке, что такое JSX: https://www.youtube.com/embed/v8q0e0bqJXk https://ru.reactjs.org/docs/introducing-jsx.html https://metanit.com/web/react/1.3.php",
    text: "JSX - это расширения языка javascript. Он более более прост по структуре и позволяет сократить кол-во кода. Используя компилятор Babel код на JSX можно преобразовать в обычный javascript.",
  },

  {
    id: "2",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 2 ",
    task: "Создать новый проект с использованием react.js. Cоздать стандартную разметку HTML5.0. Добавить div с ИД. И создать приложение с использованием ReactDOM",
    text: "[Ссылка на проект](https://stackblitz.com/github/SerzhanaB/Card2-Task3?file=src%2Findex.js)",

  },

  {
    id: "3",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 3 ",
    task: "Создать новый проект с использованием react.js. Cоздать стандартную разметку HTML5.0. Добавить div с ИД. И создать приложение с использованием ReactDOM. Приложение вычисляющее сумму первых N натуральных чисел. https://ru.reactjs.org/docs/hello-world.html [Сумма  n  первых натуральных чисел](http://www.math24.ru/%D0%BA%D0%BE%D0%BD%D0%B5%D1%87%D0%BD%D1%8B%D0%B5-%D1%87%D0%B8%D1%81%D0%BB%D0%BE%D0%B2%D1%8B%D0%B5-%D1%80%D1%8F%D0%B4%D1%8B.html)",
    text: "[Ссылка на проект](https://stackblitz.com/github/SerzhanaB/Card2-Task3?file=src%2Findex.js)",

  },

  {
    id: "4",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 4",
    task: "Изучить видео и кратко описать комментарием к карточке, что такое babel. И для чего используется: https://www.youtube.com/embed/VrayPysaeGY https://www.youtube.com/embed/WjxH7GODv6k 2) Изучить видео и кратко описать комментарием к карточке, что такое webpack. И для чего он используется: https://www.youtube.com/embed/1nQlcb7E_eg",
    text: "Babel - это компилятор, который переводит код javascript, написанный стандарте ES6 в стандарт ES5. Это необходимо, чтобы сайт отрабатывал на более ранних версиях браузера, которые не могут обрабатывать страницы написанные на стандарте ES6. Для того, чтобы использовать данный компилятор необходимо командой install установить данный компилятор, а также настроить отслеживание изменений скриптов для автоматического сохранения страниц из ES5 в ES6 в проекте. Webpack - модульный сборщик с открытым кодом для приложений на JavaScript. Т.е. когда в проекте образуется много файлов, то необходимо чтобы что-то определяло в какой последовательности загружались файлы. Для этого используют данный инструмент. Для его установки также необходимо использовать команду Install. Для корректной работы необходимо указать исходный файл, обычно это index.js, далее директорию где будут храниться сборки и как их называть, атакже загрузчики, которые обрабатывают файлы, созданные не на javascript, и плагины(пока не понятно как с ними работать и что с ними делать).",

  },

  {
    id: "5",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 5",
    task: "Изучить видео и кратко описать комментарием к карточке, что за расширение React Developer Tools. И для чего оно используется: https://www.youtube.com/embed/K2DB3B9PU9Q https://www.youtube.com/embed/-LfSE9ZxZDI",
    text: "**React Developer Tools**  и **Redux**  -  расширения для браузеров, преимущественно для Chrome, которые помогают разрабатывать приложения. В данных расширениях есть возможность увидеть дерево компонентов приложения и значения, которые они принимают. В Redux также хранить история изменения приложения и можно отследить как оно менялось. В целом инструменты направлены для тестирования и отладки веб-приложений написанных на React.",

  },
  {
    id: "6",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 6",
    task: "Создать новое приложение React https://www.youtube.com/embed/0grybmrgc2Q с использованием Material-UI library https://www.youtube.com/embed/GMfAgHcPSqc https://www.youtube.com/embed/RVSR2p6vxi0 проект и разместить на странице адаптивное меню",
    text: "Проект React  с адаптивным меню [Ссылка на проект](https://stackblitz.com/github/SerzhanaB/Card2-task6)",

  },
  

];
