export default [
  {
    id: "1",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 1",
    task: "Посмотреть видео ролик и добавить решение в комментарии ссылку на stackblitz.com и картинку запущенного решения. https://www.youtube.com/embed/5X5ZLWdAnt4 ",
    text: " ",
  },

  {
    id: "2",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 2 ",
    task: "Посмотреть видео ролик и добавить решение в комментарии ссылку на stackblitz.com и картинку запущенного решения. https://www.youtube.com/embed/z7rhAp56Xvw",
    text: " ",

  },

  {
    id: "3",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 3 ",
    task: "EN Посмотреть видео ролик и добавить решение в комментарии ссылку на stackblitz.com и картинку запущенного решения. https://www.youtube.com/embed/aHv_3g2Fw8A ",
    text: " ",

  },

  {
    id: "4",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 4",
    task: "EN Посмотреть видео ролик и добавить решение в комментарии ссылку на stackblitz.com и картинку запущенного решения. https://www.youtube.com/embed/KaoyIX-X69g",
    text: "",

  },

  {
    id: "5",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 5",
    task: "Посмотреть видео ролик и добавить решение в комментарии ссылку на stackblitz.com и картинку запущенного решения. https://www.youtube.com/embed/Vok-FQDjoiM",
    text: "",

  },
  {
    id: "6",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 6",
    task: "Посмотреть видео ролик и добавить решение в комментарии ссылку на stackblitz.com и картинку запущенного решения. https://www.youtube.com/embed/yYq0rWESsNY",
    text: "",

  },
  {
    id: "7",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 7",
    task: "Самостоятельно найдите ответ на вопрос и добавьте ответ комментарием к карточке. **Ссылки меняют только URL, а не фактический компонент, отображаемый на странице что можно сделать?**",
    text: "",

  },
  {
    id: "8",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 8",
    task: "Самостоятельно найдите ответ на вопрос и добавьте ответ комментарием к карточке. **Что такое блокировка переходов в истории api для React Router?**",
    text: " ",

  },
  {
    id: "9",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 9",
    task: "Самостоятельно найдите ответ на вопрос и добавьте ответ комментарием к карточке. **Приведите пример как получить параметры запроса и параметры контекстов в react-router-dom.**",
    text: "",

  },
  {
    id: "10",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 10",
    task: "Самостоятельно найдите ответ на вопрос и добавьте ответ комментарием к карточке. **Что такое window.performance.navigation.type и как после F5 загрузить нужную страницу?**",
    text: "",

  },

  

];
