export default [
  {
    id: "1",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 1",
    task: "Посмотреть видео ролик и добавить комментарием одностраничное описание кода из примера видео и картинку запущенного решения из stackblitz.com. https://www.youtube.com/embed/Q_UvAaKSK90 ",
    text: " ",
  },

  {
    id: "2",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 2 ",
    task: " 2: [Изучить понятие контекста](https://ru.reactjs.org/docs/context.html) и дать своё определение терминам: React.createContext; Context.Provider;Class.contextType; Context.Consumer; Context.displayName",
    text: " ",

  },

  {
    id: "3",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 3 ",
    task: " Посмотреть видео ролик и добавить комментарием одностраничное описание кода из примера видео и картинку запущенного решения из stackblitz.com https://www.youtube.com/embed/6OoMglkreKs",
    text: " ",

  },

  {
    id: "4",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 4",
    task: "4: Изучить понятие [Refs](https://ru.reactjs.org/docs/refs-and-the-dom.html) и дать определение термину: React.createRef",
    text: "",

  },

  {
    id: "5",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 5",
    task: "5: Посмотреть видео ролик и добавить комментарием одностраничное описание кода из примера видео и картинку запущенного решения из stackblitz.com https://www.youtube.com/embed/RLWniwmfdq4",
    text: "",

  },
  {
    id: "6",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 6",
    task: "Изучить понятие [перенаправления refs](https://ru.reactjs.org/docs/forwarding-refs.html) и дать определение термину: React.forwardRef",
    text: "",

  },
  {
    id: "7",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 7",
    task: "Посмотреть видео ролик и добавить комментарием одностраничное описание кода из примера видео и картинку запущенного решения из stackblitz.com https://www.youtube.com/embed/mLwsIPBDr8A",
    text: "",

  },
  {
    id: "8",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 8",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Что вам понравилось? А что хотелось бы улучшить в рассказе?  Перепишите пример с видео в вашем новом приложении на stackblitz.com и добавьте картинку запущенного решения с ссылкой в комментариях. https://www.youtube.com/embed/LIkIM5u1mCk",
    text: " ",

  },
  {
    id: "9",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 9",
    task: " Посмотреть видео ролик и добавить комментарием одностраничное описание кода из примера видео и картинку запущенного решения. https://www.youtube.com/embed/Tln-wtsp8do ",
    text: "",

  },
  {
    id: "10",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 10",
    task: "Написать новое приложение и добавить код с картинкой и ссылкой на приложение из stackblitz.com. Требования к форме. Поля ввода: Фамилия, Имя, Отчество, Дата рождения, Телефон, E-mail. Добавить кнопку Отправить. Функционал кнопки отправка данных по адресу POST: https://jsonplaceholder.typicode.com/posts Требования к запросу: по нажатию Отправить заблокировать изменение полей, после ответа с сервера поменять все поля ввода на текстовые поля. Валидация полей: Фамилия - Не более 50 символа,Имя - Не более 31 символа, Отчество - Не более 31 символа, Дата рождения - в формате dd.MM.yyyy, Телефон-Маска “+7(NNN) NNN NN NN”, где N – любая цифра, E-mail - валидация email. Все поля обязательны, кроме E-mail",
    text: "",

  },

  

];
