export default [
  {
    id: "1",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 1",
    task: "Посмотреть цикл из 4-х видео уроков React и Redux [1. Что это за Redux и зачем он нужен.](https://www.youtube.com/embed/jvkhKRHS2TY) | [2. Подключаемся к Redux.](https://www.youtube.com/embed/wzWZDh0dUYE) | [3. Структура приложения, combineReducers, контейнеры.](https://www.youtube.com/embed/MahSyZSFQv8) | [4. Redux Saga, Генераторы, Redux Thunk.](https://www.youtube.com/embed/DG9rXV1kI0o) и написать технические требования к каждому из разобранных примеров. Написать решение по собственному ТЗ и добавить в комментарии ссылку на проект в истории карточки. Ответить на вопросы что такое Генераторы, Redux Thunk и Redux Saga ",
    text: " ",
  },

  {
    id: "2",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 2 ",
    task: "Посмотреть видео и написать технические требования к разобранному приложению. Написать решение по собственному ТЗ и добавить в комментарии ссылку на проект в истории карточки. https://www.youtube.com/embed/hpR-X2hTcqg ",
    text: " ",

  },

  {
    id: "3",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 3 ",
    task: ": Посмотреть видео и написать технические требования к разобранному приложению. Написать решение по собственному ТЗ и добавить в комментарии ссылку на проект в истории карточки. https://www.youtube.com/embed/dgM9OGVfKCQ ",
    text: " ",

  },

  {
    id: "4",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 4",
    task: "Изучить материал статьи и написать технические требования к разобранному приложению. Написать решение по собственному ТЗ и добавить в комментарии ссылку на проект в истории карточки. [Redux: шаг за шагом](https://github.com/devSchacht/translations/tree/master/articles/tal-kol-redux-step-by-step-a-simple-and-robust-workflow-for-real-life-apps) Ответить на вопрос комментарием какие выводы вы сделали при изучении статьи?",
    text: "",

  },

  
];
