export default [
  {
    id: "1",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 1",
    task: " Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/hQRPsKzpo34",
    text: " ",
  },

  {
    id: "2",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 2 ",
    task: "2: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/hwPo6OLBbD8 ",
    text: " ",

  },

  {
    id: "3",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 3 ",
    task: "3: Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/QPEB3ZQLTZY ",
    text: " ",

  },

  {
    id: "4",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 4",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/rUGDM7MaRvk",
    text: "",

  },

  {
    id: "5",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 5",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/slaaDOt0ZvM",
    text: "",

  },
  {
    id: "6",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 6",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/8Yy6MDsF-Tg",
    text: "",

  },
  {
    id: "7",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 7",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/wPQlz4M4rnI",
    text: "",

  },
  {
    id: "8",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 8",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/X1Skt2n7y3U",
    text: " ",

  },
  {
    id: "9",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 9",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/ItUwRSXxwwk ",
    text: "",

  },
  {
    id: "10",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 10",
    task: "Что делает плагин eslint-plugin-react-hooks? Зачем нужен? Как настраивать?",
    text: "",

  },

  {
    id: "11",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 11",
    task: "EN Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/ScT4ElKd6eo",
    text: "",

  },

];
