export default [
  {
    id: "1",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 1",
    task: "Посмотреть и кратко описать в карточке сюжет видео ролика. Перепишите пример с видео и добавьте ссылку в комментариях. https://www.youtube.com/embed/LeysYaa8iW4",
    text: "В ролике показано как создать таблицу, используя метод map(). Исходные данные хранятся в массиве, а также добавлена кнопка для удаления элемента(строки) в массиве. Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card7_task1)",
  },

  {
    id: "2",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 2 ",
    task: "Выполнить задание Список задач Пусть в стейте дан массив: ['тестовое задание 1']. Выведите каждый элемент этого массива в отдельной <li> в списке ul.  Под списком кнопка, по нажатию на которую в конец списка будет добавляться элемент с текстом 'из поля ввода'. Добавьте кнопочку, по нажатию на которую каждый раз будет исчезать последняя li из списка (каждый раз по одной, пока li в списке не закончатся). Рядом с каждым именем добавить кнопочку, по нажатию на которую li с этим именем будет зачёркиваться запись.  Ссылку на пример добавить в комментарии.",
    text: "[Ссылка на проект](https://stackblitz.com/github/SerzhanaB/card7_task2)",

  },

  
];
