export default [
  {
    id: "1",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 1",
    task: "Добавить в свой итоговый проект меню Мои проекты на курсе. Перечислить в рамках страницы Мои проекты на курсе все темы уроков и в каждом уроке добавить список всех домашних заданий и ссылки на проделанные задачи.",
    text: " ",
  },

  {
    id: "2",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 2 ",
    task: "Добавить в свой итоговый проект меню Материалы. Перечислить в рамках страницы Темы уроков и в каждой теме: Список всех видеоуроков для домашних работ и Список всех ссылок которые предложены для домашних работ во вложении и комментариях",
    text: " ",

  },

  {
    id: "3",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 3 ",
    task: "Добавить в свой итоговый проект меню Обратная связь о курсе. Написать отзыв как вам понравился курс.",
    text: " ",

  },

  {
    id: "4",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 4",
    task: "Посмотрите https://www.youtube.com/embed/Ex2j4oIweDk. Перепишите пример и добавьте в комментариях ссылку на https://stackblitz.com/.",
    text: "",

  },

  {
    id: "5",
    date: "2021-10-10T10:00:23.000Z",
    title: "Задание 5",
    task: "Посмотрите список из 12 видеоуроков  https://www.youtube.com/embed/v4pycbXkP1Y?list=PLNkWIWHIRwMEsMUc0B-lYb7DTLroWlKLK. Перепишите примеры из видео занятий и приложите в комментариях ссылку на https://stackblitz.com/.",
    text: "",

  },
  

  

];
